/********************************************************************
 * 命名空间: AWen.Framework.UnitTest

 * 文件名称: User

 * 文件作者: Young

 * 创建时间: 2018/4/22 11:43:24
=====================================================================
 * 功能说明:
---------------------------------------------------------------------
 * 其他说明:
*********************************************************************/

namespace AWen.Framework.UnitTest
{
    public class User
    {
        public int ID { set; get; }
        public string Name { set; get; }
        public string PassWord { set; get; }
    }
}