/********************************************************************
 * 命名空间: AWen.TaskManager.Core.Model

 * 文件名称: BaseModel

 * 文件作者: AWen

 * 创建时间: 2018/4/13 10:26:22
=====================================================================
 * 功能说明: 作为类的基类使用
---------------------------------------------------------------------
 * 其他说明:
*********************************************************************/

using AWen.TaskManager.Core.Interface;
namespace AWen.TaskManager.Core.Model.Base
{
    public class BaseModel : IModel
    {
    }
}