/********************************************************************
 * 命名空间: AWen.TaskManager.Core.Common

 * 文件名称: TaskState

 * 文件作者: Young

 * 创建时间: 2018/4/13 10:13:37
=====================================================================
 * 功能说明:
---------------------------------------------------------------------
 * 其他说明:
*********************************************************************/

namespace AWen.TaskManager.Core.Common
{
    //Task状态
    public enum TaskState : int
    {
        /// <summary>
        /// 停止 表示任务结束运行最终状态
        /// </summary>
        Stopped = 0,

        /// <summary>
        /// 运行中 表示任务运行中的状态
        /// </summary>
        Running = 10,

        /// <summary>
        /// /开始及启动中 表示任务即将进入运行中的临时状态
        /// </summary>
        Starting = 20,

        /// <summary>
        /// 停止中 表示任务即将进入停止运行的临时状态
        /// </summary>
        Stopping = 30,

        /// <summary>
        /// 错误 表示任务运行错误(预留状态暂时不启用)
        /// </summary>
        Error = -1
    }
}